{
  "_name_or_path": "microsoft/conditional-detr-resnet-50",
  "activation_dropout": 0.0,
  "activation_function": "relu",
  "architectures": [
    "ConditionalDetrForObjectDetection"
  ],
  "attention_dropout": 0.0,
  "auxiliary_loss": false,
  "backbone": "eva02_base_patch14_448.mim_in22k_ft_in1k",
  "backbone_config": null,
  "backbone_kwargs": {
    "in_chans": 3,
    "out_indices": [
      1,
      2,
      3,
      4
    ]
  },
  "bbox_cost": 5,
  "bbox_loss_coefficient": 5,
  "class_cost": 2,
  "cls_loss_coefficient": 2,
  "d_model": 256,
  "decoder_attention_heads": 8,
  "decoder_ffn_dim": 2048,
  "decoder_layerdrop": 0.0,
  "decoder_layers": 6,
  "dice_loss_coefficient": 1,
  "dilation": false,
  "dropout": 0.1,
  "encoder_attention_heads": 8,
  "encoder_ffn_dim": 2048,
  "encoder_layerdrop": 0.0,
  "encoder_layers": 6,
  "focal_alpha": 0.25,
  "giou_cost": 2,
  "giou_loss_coefficient": 2,
  "id2label": {
    "0": "General trash",
    "1": "Paper",
    "2": "Paper pack",
    "3": "Metal",
    "4": "Glass",
    "5": "Plastic",
    "6": "Styrofoam",
    "7": "Plastic bag",
    "8": "Battery",
    "9": "Clothing"
  },
  "init_std": 0.02,
  "init_xavier_std": 1.0,
  "is_encoder_decoder": true,
  "label2id": {
    "Battery": 8,
    "Clothing": 9,
    "General trash": 0,
    "Glass": 4,
    "Metal": 3,
    "Paper": 1,
    "Paper pack": 2,
    "Plastic": 5,
    "Plastic bag": 7,
    "Styrofoam": 6
  },
  "mask_loss_coefficient": 1,
  "max_position_embeddings": 1024,
  "model_type": "conditional_detr",
  "num_channels": 3,
  "num_hidden_layers": 6,
  "num_queries": 300,
  "position_embedding_type": "sine",
  "scale_embedding": false,
  "torch_dtype": "float32",
  "transformers_version": "4.45.2",
  "use_pretrained_backbone": true,
  "use_timm_backbone": true
}
