{
  "_name_or_path": "/data/ephemeral/home/Dongjin/level2-objectdetection-cv-07/transformers/Dongjin/1011_model_search/result/1015/jozhang97/deta-swin-large_3_img_size_720/checkpoint-15704",
  "activation_dropout": 0.0,
  "activation_function": "relu",
  "architectures": [
    "DetaForObjectDetection"
  ],
  "assign_first_stage": true,
  "assign_second_stage": true,
  "attention_dropout": 0.0,
  "auxiliary_loss": true,
  "backbone": null,
  "backbone_config": {
    "attention_probs_dropout_prob": 0.0,
    "depths": [
      2,
      2,
      18,
      2
    ],
    "drop_path_rate": 0.1,
    "embed_dim": 192,
    "encoder_stride": 32,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.0,
    "hidden_size": 1536,
    "image_size": 224,
    "initializer_range": 0.02,
    "layer_norm_eps": 1e-05,
    "mlp_ratio": 4.0,
    "model_type": "swin",
    "num_heads": [
      6,
      12,
      24,
      48
    ],
    "num_layers": 4,
    "out_features": [
      "stage2",
      "stage3",
      "stage4"
    ],
    "out_indices": [
      2,
      3,
      4
    ],
    "patch_size": 4,
    "path_norm": true,
    "qkv_bias": true,
    "use_absolute_embeddings": false,
    "window_size": 12
  },
  "backbone_kwargs": null,
  "bbox_cost": 5,
  "bbox_loss_coefficient": 5,
  "class_cost": 1,
  "d_model": 256,
  "decoder_attention_heads": 8,
  "decoder_ffn_dim": 2048,
  "decoder_layerdrop": 0.0,
  "decoder_layers": 6,
  "decoder_n_points": 4,
  "dice_loss_coefficient": 1,
  "disable_custom_kernels": true,
  "dropout": 0.1,
  "encoder_attention_heads": 8,
  "encoder_ffn_dim": 2048,
  "encoder_layerdrop": 0.0,
  "encoder_layers": 6,
  "encoder_n_points": 4,
  "eos_coefficient": 0.1,
  "focal_alpha": 0.25,
  "giou_cost": 2,
  "giou_loss_coefficient": 2,
  "id2label": {
    "0": "General trash",
    "1": "Paper",
    "2": "Paper pack",
    "3": "Metal",
    "4": "Glass",
    "5": "Plastic",
    "6": "Styrofoam",
    "7": "Plastic bag",
    "8": "Battery",
    "9": "Clothing"
  },
  "init_std": 0.02,
  "init_xavier_std": 1.0,
  "is_encoder_decoder": true,
  "label2id": {
    "Battery": 8,
    "Clothing": 9,
    "General trash": 0,
    "Glass": 4,
    "Metal": 3,
    "Paper": 1,
    "Paper pack": 2,
    "Plastic": 5,
    "Plastic bag": 7,
    "Styrofoam": 6
  },
  "mask_loss_coefficient": 1,
  "max_position_embeddings": 2048,
  "model_type": "deta",
  "num_feature_levels": 5,
  "num_queries": 900,
  "position_embedding_type": "sine",
  "torch_dtype": "float32",
  "transformers_version": "4.45.2",
  "two_stage": true,
  "two_stage_num_proposals": 900,
  "use_pretrained_backbone": false,
  "use_timm_backbone": false,
  "with_box_refine": true
}
