{
  "_name_or_path": "hustvl/yolos-small",
  "architectures": [
    "YolosForObjectDetection"
  ],
  "attention_probs_dropout_prob": 0.0,
  "auxiliary_loss": false,
  "bbox_cost": 5,
  "bbox_loss_coefficient": 5,
  "class_cost": 1,
  "eos_coefficient": 0.1,
  "giou_cost": 2,
  "giou_loss_coefficient": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 384,
  "id2label": {
    "0": "General trash",
    "1": "Paper",
    "2": "Paper pack",
    "3": "Metal",
    "4": "Glass",
    "5": "Plastic",
    "6": "Styrofoam",
    "7": "Plastic bag",
    "8": "Battery",
    "9": "Clothing"
  },
  "image_size": [
    512,
    864
  ],
  "initializer_range": 0.02,
  "intermediate_size": 1536,
  "label2id": {
    "Battery": 8,
    "Clothing": 9,
    "General trash": 0,
    "Glass": 4,
    "Metal": 3,
    "Paper": 1,
    "Paper pack": 2,
    "Plastic": 5,
    "Plastic bag": 7,
    "Styrofoam": 6
  },
  "layer_norm_eps": 1e-12,
  "model_type": "yolos",
  "num_attention_heads": 6,
  "num_channels": 3,
  "num_detection_tokens": 100,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.45.2",
  "use_mid_position_embeddings": true
}
